<template>
	<div>
		<slot name="title" />
		<slot name="description" />

		<div class="grid grid-cols-1 md:grid-cols-2 gap-5">
			<Card>
				<ProseH3>เทคนิคสกรีนเสื้อแบบยาง</ProseH3>
				<ProseP
					>เทคนิคสกรีนเสื้อแบบยางที่นิยมกันอย่างแพร่หลาย
					เทคนิคแบบไฮเดนที่ทำให้เสื้อของคุณมีมิติ
					เทคนิคแบบไล่สีที่ช่วยให้เสื้อของคุณมีลูกเล่นมากขึ้น
					และเทคนิคแบบฟรอยทองที่ทำให้เสื้อของคุณดูดีมีมูลค่า</ProseP
				>
				<ProseImg
					class="w-full"
					src="/screen-tshirt-service/technique-1.png"
					alt="เทคนิคที่โรงงานผลิตเสื้อของเราใช้ เช่น เทคนิคสกรีนเสื้อแบบยาง เทคนิคสกรีนเสื้อแบบไฮเดน เทคนิคสกรีนเสื้อแบบไล่สี"
				/>
			</Card>

			<Card>
				<ProseH3>ใช้สีสกรีนเสื้อคุณภาพ</ProseH3>
				<ProseP
					>เราเลือกใช้สีสกรีนเสื้อมีคุณภาพเพื่อให้เสื้อสกรีนของคุณสีชัด ติดทนนาน
					เรารับสกรีนสินค้าพรีเมียมต่าง ๆ ไม่ว่าจะเป็น หน้ากากผ้า ถุงผ้า ผ้ากันเปื้อน
					และแก้วน้ำค่ะ</ProseP
				>
				<ProseImg
					class="w-full"
					src="/screen-tshirt-service/technique-2.png"
					alt="ราคาสั่งสกรีนเสื้อ DTG พรีเมี่ยม ราคา สกรีนเสื้อ"
				/>
			</Card>
		</div>
	</div>
</template>
