<script setup lang="ts">
	const data = ref([
		{
			nameTh: "คอตตอนกันน้ำ",
			nameEn: "Cotton waterproof",
			description:
				"เป็นผ้า cotton ที่มีความสามารถในการระบายความร้อนสูง ผลิตจากเส้นใยฝ้ายธรรมชาติทำให้มีความนุ่ม น้ำหนักเบา สบาย ยืดหยุ่น เคลือบสาร water rellent ทำให้ผ้ามีลักษณะคล้ายผิวของใบบัว น้ำจึงไม่ซึมเข้าผิวผ้า โดยเนื้อผ้าชนิดนี้สามารถซักได้ถึง 30 ครั้ง ไม่ระคายเคืองผิวเหมาะกับการผลิตหน้ากากผ้า",
		},
		{
			nameTh: "คอตตอนคอมป์",
			nameEn: "Cotton comb",
			description:
				"เป็นผ้า cotton ที่ใช้การผลิตเส้นด้ายด้วยการหวีเส้นใยกับเครื่องจักรที่มีกระบวนการซับซ้อนและละเอียดอ่อนกว่าแบบสาง ทำให้เส้นด้ายที่ออกมามีขนาดเล็กและยาวกว่า ขจัดสิ่งสกปรกออกจากเส้นใยได้มากกว่า ผ้า cotton ชนิดนี้จึงมีความนุ่ม ขาดยาก แต่ยังระบายความร้อนได้ดี ไม่ยับและไม่หดง่าย จึงเหมาะกับการผลิตเสื้อยืดแบรนด์ตัวเอง",
		},
		{
			nameTh: "คอตตอน 100%",
			nameEn: "Cotton semi",
			description:
				"ผ้า cotton 100% ใช้การผลิตเส้นด้ายด้วยกระบวนการสางเส้นใยโดยเครื่องจักร เส้นด้ายที่ออกมามีขนาดใหญ่และสั้น มีความนุ่มอยู่ในระดับปานกลาง คุณสมบัติพิเศษของผ้า cotton คือราคาไม่สูง เนื้อผ้ามีความหนาและยับยาก",
		},
		{
			nameTh: "ดรายฟีล",
			nameEn: "Dry feel",
			description:
				"เป็นผ้าชนิดที่รวมข้อดีของผ้า cotton และผ้า polyester ไว้ด้วยกัน โดยจะทอผ้าทั้งสองชนิดไว้คนละฝั่งกัน ทำให้หน้าผ้านสองฝั่งที่ออกมาเป็นคนละชนิดกัน เนื้อผ้าดรายฟีลจึงเป็นเนื้อผ้าเกรดดีที่สุดในท้องตลาด ด้วยการรวมข้อดีของผ้าทั้งสองชนิดเข้าไว้ด้วยกัน ด้วยคุณสมบัติพิเศษที่สามารถซับเหงื่อได้ดี ผ้าอยู่ตัวยับยาก ไม่ขึ้นขุยหลังการซัก สวมใสสบายเหมาะสำหรับผลิตเสื้อยูนิฟอร์ม",
		},
		{
			nameTh: "ดรายเท็กซ์",
			nameEn: "Dry tech",
			description:
				"เป็นผ้าชนิดที่รวมข้อดีของผ้า cotton และผ้า polyester ไว้ด้วยกัน โดยจะทอผ้าทั้งสองชนิดไว้คนละฝั่งกัน ทำให้หน้าผ้านสองฝั่งที่ออกมาเป็นคนละชนิดกัน เนื้อผ้าดรายเท็กซ์จึงเป็นเนื้อผ้าอีกชนิดที่มีเกรดดีในท้องตลาด ด้วยคุณสมบัติพิเศษที่สามารถซับเหงื่อได้ดี ผ้าไม่ยับ ไม่ขึ้นขุยแม้ซักหลายครั้ง สวมใส่สบาย เหมาะสำหรับผลิตเสื้อยูนิฟอร์ม เสื้อพนักงาน",
		},
		{
			nameTh: "ไมโครกีฬา",
			nameEn: "Micro sport",
			description:
				"เป็นเนื้อผ้าที่ออกแบบมาเพื่อสวมใส่ในการออกกำลังกายโดยเฉพาะ เนื่องจากผ้าชนิดนี้มีการซึมซับเหงื่อและระบายอากาศที่ดีเยี่ยม แห้งเร็วกว่าปกติถึง 3 เท่า ราคาไม่สูง ผิวสัมผัสเนียนนุ่ม และถึงแม้จะผ่านการซักหลายครั้ง แต่เนื้อผ้ายังคงดูใหม่อยู่เสมอ",
		},
		{
			nameTh: "จูติไมโคร",
			nameEn: "Juti micro",
			description:
				"เป็นเนื้อผ้าที่ออกแบบมาเพื่อแทนที่เนื้อผ้าที่ใช้ผลิตยูนิฟอร์มในรูปแบบเดิมๆ ที่ใช้ไปสักพักแล้วสีซีดหรือขึ้นขุยทำให้ต้องเปลี่ยนอยู่บ่อยครั้ง แต่เนื้อผ้าจูติไมโครมีความทนทานมากกว่าแบบเดิม ๆ บวกกับคุณสมบัติพิเศษของผ้าไมโครที่แห้งเร็ว ระบายความร้อนได้ดี ผิวสัมผัสปานกลาง เมื่อซักแล้วสีไม่ซีด ขึ้นขุยยาก และเหมาะสำหรับเสื้อโปโล จึงทำให้เนื้อผ้าชนิดนี้ได้รับความนิยมมากที่สุด",
		},
		{
			nameTh: "มัสลินธรรมดา",
			nameEn: "Muslin",
			description:
				"เป็นเนื้อผ้าที่นิยมนำมาผลิตเป็นหน้ากากผ้าอนามัย และหลาย ๆ คนมักใช้ทำเป็นปลอกหมอนหรือเครื่องนอนที่ป้องกันไรฝุ่น เนื่องจากผ้าชนิดนี้ทำมาจากผ้าฝ้าย 100% ทำให้ระบายกาศได้ดีมีน้ำหนักเบาและสามารถกันละอองน้ำได้ดีเยี่ยม อีกทั้งยังมีความแข็งแรงต่อการซักสามารถซักได้มากกว่า 100 ครั้ง",
		},
		{
			nameTh: "นาโนกันน้ำ",
			nameEn: "Nano waterproof",
			description:
				"มีคุณสมบัติกันน้ำ ผลิตจากวัสดุคุณภาพดี ไม่ย้วย ทนทานเนื้อผ้าบางเบา สวมใส่ได้ทั้งผู้หญิงและผู้ชาย เหมาะสำหรับการใส่ออกกำลังกายหรือเล่นกีฬา เพราะสามารถระบายอากาศได้ดี ใส่แล้วไม่ทำให้รู้สึกร้อน แห้งเร็ว ทำให้ช่วยลดการอับชื้น",
		},
		{
			nameTh: "ซูเปอร์ซอฟ",
			nameEn: "Supersoff",
			description:
				"เป็นผ้าที่ผลิตจากเส้นใยฝ้าธรรมชาติ  มีคุณสมบัติพิเศษ คือผิวสัมผัสที่หนานุ่ม แต่สามารถระบายอากาศได้ดีเยี่ยม ในสภาพอากาศร้อนเหมือนกับใส่เสื้อผ้าบางๆ อีกทั้งไม่ขึ้นขุยหลังจากซัก เหมาะในการทำไปผลิตเป็นเสื้อแบรนด์",
		},
		{
			nameTh: "ทีซี ลาครอส",
			nameEn: "TC lacoste",
			description:
				"เป็นเนื้อผ้าที่ได้รับความนิยมมากที่สุด ออกแบบมาเพื่อผลิตเป็นยูนิฟอร์ม เนื่องจากมีการระบายอากาศได้ดีในระดับหนึ่งเนื้อผ้าผิวสัมผัสมีความนุ่ม ไม่หด ไม่ย้วย เป็นขุยยากแม้ว่าจะผ่านการซักหลายครั้งและมีความเรียบ จึงเหมาะแก่การนำมาเป็นยูนิฟอร์มสำหรับใส่ทำงาน",
		},
		{
			nameTh: "ทีซี/ทีเค",
			nameEn: "TC/TK",
			description:
				"เป็นเนื้อผ้าอีกชนิดหนึ่งที่ได้รับความนิยมเพราะมีราคาถูก นำหนักเบา ระบายความร้อน ด้วยความหนากำลังดีทำให้สวมใส่สบาย มีส่วนผสมของ polyester และ cotton เพื่อให้เหมาะสมสำหรับการสวมใส่ที่หลากหลาย มีคุณสมบัติพิเศษคือเนื้อผ้ามีความแน่นละเอียด รีดง่าย ยับยาก ทนต่อการซัก",
		},
	])
</script>

<template>
	<div>
		<ProseH2><slot name="title" mdc-unwrap="p" /></ProseH2>
		<ProseP class="text-lg mb-5"><slot name="description" mdc-unwrap="p" /></ProseP>

		<div class="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-5">
			<div
				v-for="item in data"
				:key="item.nameEn"
				class="bg-stone-50 border border-stone-300 rounded-lg p-3"
			>
				<ProseH3>{{ item.nameTh }} ({{ item.nameEn }})</ProseH3>
				<ProseP>{{ item.description }}</ProseP>
			</div>
		</div>
	</div>
</template>
