<script setup lang="ts">
	// VARIABLE
	const data = ref([
		{
			text: "“สมศรีมีเสื้อ” เราเป็นโรงงานผลิตเสื้อยืดครบบวงจรที่มีประสบการณ์มากมายเรื่องเสื้อ ตั้งแต่ขั้นตอนการผลิตเสื้อ ออกแบบเสื้อ สกรีนเสื้อและปักเสื้อ",
		},
		{
			text: "นอกจากเป็นโรงงานผลิตเสื้อแล้ว ทางเรายังมีสินค้าพรีเมี่ยมอีกหลากหลายชนิด ที่คุณสามารถสั่งทำได้ ไม่ว่าจะเป็น เสื้อโปโล เสื้อกีฬา หน้ากาก กระเป๋าผ้า หมวก และสินค้าอื่น ๆ อย่างปลอกหมอน และปลอกหมอนข้าง",
		},
		{
			text: "ลูกค้าที่สั่งผลิตเสื้อกับเราจึงมั่นใจได้ว่าสินค้าของคุณจะออกมาสวยงาม ถูกต้องตามแบบ สกรีนแน่น ทนทานต่อการซัก ส่งต่อความมั่นใจในทุกวันที่สวมใส่ ซึ่งโรงงานผลิตเสื้อผ้าของเราก็มีขั้นตอนการสั่งซื้อที่แสนสะดวกและรวดเร็ว เพียงไม่กี่ขั้นตอนก็รอรับเสื้อสุดมีสไตล์ไปใส่กันได้เลย",
		},
	])
</script>
<template>
	<div class="grid grid-cols-1 lg:grid-cols-3 gap-5">
		<div v-for="item in data" :key="item.text" class="bg-primary rounded-xl p-3">
			<p class="text-lg text-white">{{ item.text }}</p>
		</div>
	</div>
</template>
