<script setup lang="ts"></script>
<template>
    <div class="my-5">
        <AboutHeader>
            <template #header>เกี่ยวกับโครงการ</template>
            <template #image-banner>
                <ProseImg src="/images/about-banner.png" alt="About Banner" class="rounded-2xl shadow-lg max-h-60 object-cover" />
            </template>
            <template #description-text>
                โครงการพัฒนาระบบสารสนเทศเพื่อการบริหารจัดการข้อมูลนักเรียนโรงเรียนสตรีสมุทรปราการ เป็นโครงการที่มุ่งเน้นการสร้างระบบสารสนเทศที่มีประสิทธิภาพและใช้งานง่าย
                เพื่อช่วยให้โรงเรียนสามารถบริหารจัดการข้อมูลนักเรียนได้อย่างมีประสิทธิภาพมากยิ่งขึ้น
            </template>
            <template #description-list>
                ระบบนี้จะช่วยให้ครูและเจ้าหน้าที่สามารถเข้าถึงข้อมูลนักเรียนได้อย่างรวดเร็วและง่ายดาย รวมถึงการจัดการข้อมูลต่าง ๆ เช่น ข้อมูลส่วนตัว ประวัติการศึกษา ผลการเรียน และกิจกรรมต่าง ๆ
                ที่นักเรียนเข้าร่วม นอกจากนี้ ระบบยังมีฟีเจอร์ต่าง ๆ ที่ช่วยในการวิเคราะห์ข้อมูล และสร้างรายงานที่เป็นประโยชน์สำหรับการตัดสินใจในการบริหารจัดการโรงเรียน
            </template>
            <template #slogan-text>วิสัยทัศน์</template>
            <template #description-slogan> พัฒนาระบบสารสนเทศที่ทันสมัยและมีประสิทธิภาพ เพื่อสนับสนุนการบริหารจัดการข้อมูลนักเรียนอย่างครบวงจร </template>
            <template #strategy-text>กลยุทธ์</template>
            <template #strategy-list>
                <ul class="list-disc pl-5 space-y-2">
                    <li>ออกแบบระบบที่ใช้งานง่ายและตอบสนองความต้องการของผู้ใช้</li>
                    <li>พัฒนาฟีเจอร์ที่ช่วยในการวิเคราะห์ข้อมูลและสร้างรายงาน</li>
                    <li>รับฟังความคิดเห็นและข้อเสนอแนะจากผู้ใช้เพื่อปรับปรุงระบบอย่างต่อเนื่อง</li>
                    <li>ส่งเสริมการใช้เทคโนโลยีสารสนเทศในกระบวนการบริหารจัดการโรงเรียน</li>
                </ul>
            </template>
        </AboutHeader>
    </div>
</template>
